In [1]:
# import pandass 
import pandas as pd

In [3]:
# import data 
data = pd.read_csv(r"E:\python 1 pm\stats_for_data_analysis\cars_data_updated.csv")

In [4]:
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

# Explore

In [17]:
# columns ()  it returns the name of columns in dataset
data.columns

Index(['location', 'year', 'run', 'fuel_type', 'trans', 'owner', 'mileage',
       'engine', 'power', 'seats', 'new_price', 'price', 'brand', 'model'],
      dtype='object')

In [18]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 14 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   location   7253 non-null   object
 1   year       7253 non-null   int64
 2   run        7253 non-null   int64
 3   fuel_type  7253 non-null   object
 4   trans      7253 non-null   object
 5   owner      7253 non-null   object
 6   mileage    7251 non-null   float64
 7   engine     7207 non-null   float64
 8   power      7078 non-null   float64
 9   seats      7200 non-null   float64
 10  new_price  1006 non-null   object
 11  price      6019 non-null   float64
 12  brand      7253 non-null   object
 13  model      7253 non-null   object
dtypes: float64(5), int64(2), object(7)
memory usage: 793.4+ KB

In [19]:
data

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,8.61 Lakh,4.50,Honda,Jazz
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00,Maruti,Ertiga
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,NaN,17.74,Audi,A4
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
7248,Hyderabad,2011,89411,Diesel,Manual,First,20.54,1598.0,103.60,5.0,NaN,NaN,Volkswagen,Vento
7249,Mumbai,2015,59000,Petrol,Automatic,First,17.21,1197.0,103.60,5.0,NaN,NaN,Volkswagen,Polo
7250,Kolkata,2012,28000,Diesel,Manual,First,23.08,1461.0,63.10,5.0,NaN,NaN,Nissan,Micra
7251,Pune,2013,52262,Petrol,Automatic,Third,17.20,1197.0,103.60,5.0,NaN,NaN,Volkswagen,Polo
7252,Kochi,2014,72443,Diesel,Automatic,First,10.00,2148.0,170.00,5.0,NaN,NaN,Mercedes-Benz,E-Class

In [22]:
# unique() , it returns the unique values in a column in form list 
# find all the unique brands 
data.brand.unique()

array(['Maruti', 'Hyundai', 'Honda', 'Audi', 'Nissan', 'Toyota',
       'Volkswagen', 'Tata', 'Land', 'Mitsubishi', 'Renault',
       'Mercedes-Benz', 'BMW', 'Mahindra', 'Ford', 'Porsche', 'Datsun',
       'Jaguar', 'Volvo', 'Chevrolet', 'Skoda', 'Mini', 'Fiat', 'Jeep',
       'Smart', 'Ambassador', 'Isuzu', 'ISUZU', 'Force', 'Bentley',
       'Lamborghini', 'Hindustan', 'OpelCorsa'], dtype=object)

In [23]:
# nunique() , it count the number of unique values in a dataframe 
# count the number of unique brands in the dataframe 
data.brand.nunique()

33

In [24]:
# valuecount(), it counts the frequency of each item in a column of a dataframe 
data.brand.value_counts()

brand
Maruti           1444
Hyundai          1340
Honda             743
Toyota            507
Mercedes-Benz     380
Volkswagen        374
Ford              351
Mahindra          331
BMW               312
Audi              285
Tata              228
Skoda             202
Renault           170
Chevrolet         151
Nissan            117
Land               67
Jaguar             48
Fiat               38
Mitsubishi         36
Mini               31
Volvo              28
Jeep               19
Porsche            19
Datsun             17
Force               3
ISUZU               3
Isuzu               2
Bentley             2
Smart               1
Ambassador          1
Lamborghini         1
Hindustan           1
OpelCorsa           1
Name: count, dtype: int64

In [25]:
# max() , it returns the maximum value in a columm 
# find the maximum value of mileage 
data.mileage.max()

np.float64(33.54)

In [26]:
# min() , it returns the minimum values in a column
# find the minimum value of mileage 
data.mileage.min()

np.float64(0.0)

In [29]:
# mean() it returns the mean value in a column
# find the mean value of mileage 
data.mileage.mean()

np.float64(18.141580471659083)

In [30]:
# median() it returns the median value in a column 
data.mileage.median()

np.float64(18.16)

In [31]:
# mode() it returns the most frequent item in a column 
# find the mode value of mileage 
data.mileage.mode()

0    17.0
Name: mileage, dtype: float64

In [32]:
data.model.mode()

0    Swift
Name: model, dtype: object

In [33]:
# highest selling brand 
data.brand.mode()

0    Maruti
Name: brand, dtype: object

In [34]:
data.year.mode()

0    2015
Name: year, dtype: int64

In [35]:
# std() , it returns the standard deviation 
# find the standard deviation of mileage 
data.mileage.std()

np.float64(4.562196601725892)

In [62]:
# aggerated function , ie agg() functiopm 
data[['mileage','power']].agg(['min', 'max', 'mean'])

       mileage       power
min    0.00000   34.200000
max   33.54000  616.000000
mean  18.14158  112.765214

In [36]:
# quantile() , it returans quantile value or it also returns percentiles of given columns 
# find first quartilne(0.25) of mileage 
data.mileage.quantile(0.25)

np.float64(15.17)

In [ ]:
# sort() / sortby()

In [40]:
data.sort_values(by=['location']) # sorts data by location , in ascending order by default

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
6663,Ahmedabad,2014,84004,Diesel,Automatic,First,20.38,1968.0,143.00,5.0,NaN,NaN,Audi,A3
6984,Ahmedabad,2015,71588,Diesel,Manual,First,27.39,1248.0,74.00,5.0,NaN,NaN,Maruti,Baleno
5755,Ahmedabad,2008,51000,Petrol,Manual,First,17.00,1086.0,NaN,5.0,NaN,1.75,Hyundai,Santro
2260,Ahmedabad,2012,95000,Diesel,Automatic,Second,22.48,1995.0,190.00,5.0,63.71 Lakh,17.50,BMW,5
4247,Ahmedabad,2012,75000,Diesel,Automatic,Second,12.39,2179.0,147.51,5.0,NaN,17.50,Land,Rover
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2905,Pune,2011,95995,Diesel,Automatic,First,18.48,1995.0,177.00,5.0,NaN,15.50,BMW,5
5309,Pune,2009,75000,Petrol,Manual,Second,14.70,1150.0,76.00,5.0,NaN,1.00,Chevrolet,Aveo
5308,Pune,2013,74000,Petrol,Manual,First,22.00,1197.0,81.80,5.0,7.67 Lakh,4.50,Maruti,Dzire
5338,Pune,2012,55000,Petrol,Automatic,Second,15.00,1396.0,98.60,5.0,NaN,3.75,Hyundai,i20
4422,Pune,2014,90000,Petrol,Manual,Second,20.36,1197.0,78.90,5.0,NaN,2.80,Hyundai,i10

In [41]:
data.sort_values(by=['location'], ascending=False) # sorts the data by location in descending order

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
1414,Pune,2012,65000,Diesel,Manual,First,22.30,1248.0,74.00,5.0,NaN,2.5,Tata,Indica
6323,Pune,2011,75000,Petrol,Manual,First,18.50,1197.0,80.00,5.0,NaN,NaN,Hyundai,i20
3959,Pune,2016,64000,Petrol,Automatic,First,23.10,998.0,67.04,5.0,NaN,4.2,Maruti,Celerio
4829,Pune,2014,71000,Diesel,Manual,Second,25.80,1498.0,98.60,5.0,NaN,4.5,Honda,Amaze
2142,Pune,2012,100000,Petrol,Manual,First,20.92,998.0,67.10,5.0,NaN,1.8,Maruti,Alto
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
2388,Ahmedabad,2013,40000,Petrol,Manual,First,17.00,1197.0,80.00,5.0,NaN,4.9,Hyundai,i20
6655,Ahmedabad,2012,50000,Diesel,Automatic,Second,14.21,2143.0,203.00,5.0,NaN,NaN,Mercedes-Benz,E-Class
7071,Ahmedabad,2009,90000,Petrol,Manual,First,18.50,1197.0,80.00,5.0,NaN,NaN,Hyundai,i20
2998,Ahmedabad,2014,78616,Diesel,Automatic,Second,14.84,2143.0,170.00,5.0,NaN,15.5,Mercedes-Benz,New
5492,Ahmedabad,2012,50123,Diesel,Manual,First,17.00,1405.0,70.00,5.0,NaN,1.9,Tata,Indigo

In [42]:
data.sort_values(by=['location', 'year'])

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
1318,Ahmedabad,2002,85000,Petrol,Manual,First,13.00,1343.0,90.00,5.0,NaN,1.20,Honda,City
3200,Ahmedabad,2004,60000,Petrol,Manual,Second,17.30,1061.0,64.00,5.0,NaN,1.40,Maruti,Wagon
3061,Ahmedabad,2005,58000,Petrol,Manual,Second,0.00,999.0,NaN,5.0,NaN,1.51,Hyundai,Santro
5843,Ahmedabad,2005,81000,Petrol,Manual,Second,15.90,1298.0,85.00,5.0,NaN,0.75,Maruti,Esteem
194,Ahmedabad,2007,60006,Petrol,Manual,First,0.00,NaN,NaN,NaN,NaN,2.95,Honda,City
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
5940,Pune,2018,27000,Diesel,Manual,First,28.40,1248.0,73.75,5.0,7.91 Lakh,5.90,Maruti,Dzire
5941,Pune,2018,1000,Petrol,Manual,First,25.17,799.0,53.30,5.0,4.45 Lakh,3.40,Renault,KWID
6155,Pune,2018,24001,Diesel,Automatic,First,13.60,1999.0,177.00,5.0,52.96 Lakh,NaN,Jaguar,XE
5339,Pune,2019,1000,Petrol,Manual,First,17.19,1197.0,81.86,5.0,10.25 Lakh,8.60,Hyundai,i20
6529,Pune,2019,1015,Petrol,Automatic,First,19.00,1199.0,88.70,5.0,10.55 Lakh,NaN,Honda,Jazz

In [47]:
# Sort Values Column wise 
list_columns = data.columns.to_list()

In [50]:
list_columns= sorted(list_columns)

In [52]:
df = data.copy()

In [55]:
df.columns=df.columns(list_columns)

TypeError: 'Index' object is not callable

In [56]:
df.columns = list_columns

In [58]:
df.head(2)

,brand,engine,fuel_type,location,mileage,model,new_price,owner,power,price,run,seats,trans,year
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [59]:
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

<h1> <b> Data Cleaning with Pandas </h1> </b>

<h2> <b> Renaming , Adding and Dropping Columns </b> </h2>

In [63]:
data.columns

Index(['location', 'year', 'run', 'fuel_type', 'trans', 'owner', 'mileage',
       'engine', 'power', 'seats', 'new_price', 'price', 'brand', 'model'],
      dtype='object')

In [67]:
# rename a single column 
data.rename(columns = {'fuel_type':'FUEL'}, inplace=True)

In [68]:
data.head(2)

,location,year,run,FUEL,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [72]:
data.head(2)

,location,year,run,FUEL,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [70]:
data.head(2)

,location,year,run,FUEL,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [73]:
# renaming multiple columns at one 
data.columns

Index(['location', 'year', 'run', 'FUEL', 'trans', 'owner', 'mileage',
       'engine', 'power', 'seats', 'new_price', 'price', 'brand', 'model'],
      dtype='object')

In [74]:
data.rename(columns= {'location':'place', 'year':'time','run':'kms'}, inplace=True)
data.head(2)

,place,time,kms,FUEL,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [ ]:
# dropping the columns
# single columns 
# multiple 
# specific data types

In [79]:
data.drop('new_price', axis=1, inplace=True) # drops a single column named 'new_price'

In [80]:
data.head(2)

,place,time,kms,FUEL,trans,owner,mileage,engine,power,seats,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,12.50,Hyundai,Creta

In [81]:
# drop multiple columns 
data.drop(['brand','model', 'kms'],axis=1, inplace=True)

In [82]:
data.head(2)

    place  time    FUEL   trans  owner  mileage  engine   power  seats  price
0  Mumbai  2010     CNG  Manual  First    26.60   998.0   58.16    5.0   1.75
1    Pune  2015  Diesel  Manual  First    19.67  1582.0  126.20    5.0  12.50

In [84]:
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7253 entries, 0 to 7252
Data columns (total 10 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   place    7253 non-null   object
 1   time     7253 non-null   int64
 2   FUEL     7253 non-null   object
 3   trans    7253 non-null   object
 4   owner    7253 non-null   object
 5   mileage  7251 non-null   float64
 6   engine   7207 non-null   float64
 7   power    7078 non-null   float64
 8   seats    7200 non-null   float64
 9   price    6019 non-null   float64
dtypes: float64(5), int64(1), object(4)
memory usage: 566.8+ KB

In [97]:
# Adding Columns

In [98]:
data = pd.read_csv(r"E:\python 1 pm\stats_for_data_analysis\cars_data_updated.csv") # load the data again
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta

In [99]:
# Add Calculated Columns 
# Create a colunmns that shows 10 % or price value of each car 
# sytnax 
data_frame[new_col_name] = expression

In [104]:
data['price'].isna().sum()

np.int64(1234)

In [108]:
data['new_price']*0.1

TypeError: can't multiply sequence by non-int of type 'float'

In [105]:
data['mileage_10p'] = data['mileage'] * 0.1
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model,mileage_10p
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon,2.660
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta,1.967

In [106]:
# Create 10 % value of engine 
data['engine_new'] = data['engine'] *0.1
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model,mileage_10p,engine_new
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon,2.660,99.8
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta,1.967,158.2

In [107]:
# Create 10 % value of price 
data['new_price_value'] = data['price'] *0.1
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model,mileage_10p,engine_new,new_price_value
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon,2.660,99.8,0.175
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta,1.967,158.2,1.250

In [109]:
# Add Columns using functions 
# Create a mileage category 
data.mileage.agg(['min', 'max'])

min     0.00
max    33.54
Name: mileage, dtype: float64

In [110]:
def mileage_classify(value): 
    if value >=30:  # 30 above
        return "Very Good Mileage"
    elif value >=20:  # 20 - 29 
        return "Good Mileage"
    elif value >=10: # 
        return "Nice Mileage" 
    else: 
        return "Bad Mileage"

In [111]:
data['mileage'].apply(mileage_classify)

0       Good Mileage
1       Nice Mileage
2       Nice Mileage
3       Good Mileage
4       Nice Mileage
            ...
7248    Good Mileage
7249    Nice Mileage
7250    Good Mileage
7251    Nice Mileage
7252    Nice Mileage
Name: mileage, Length: 7253, dtype: object

In [112]:
data['mileage class'] = data['mileage'].apply(mileage_classify)
data.head(2)

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model,mileage_10p,engine_new,new_price_value,mileage class
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon,2.660,99.8,0.175,Good Mileage
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta,1.967,158.2,1.250,Nice Mileage

In [113]:
data['mileage'] + data['power']

0        84.76
1       145.87
2       106.90
3       109.53
4       156.00
         ...
7248    124.14
7249    120.81
7250     86.18
7251    120.80
7252    180.00
Length: 7253, dtype: float64

In [ ]:
0-9 Bad Mileage
10-19 Nice Mileage 
20-29 Good Mileage
30 Above Very Good Mileage

In [88]:
# Drop all categorical values 
new_data = data.select_dtypes(['int64', 'float64'])

In [89]:
new_data

      time  mileage  engine   power  seats  price
0     2010    26.60   998.0   58.16    5.0   1.75
1     2015    19.67  1582.0  126.20    5.0  12.50
2     2011    18.20  1199.0   88.70    5.0   4.50
3     2012    20.77  1248.0   88.76    7.0   6.00
4     2013    15.20  1968.0  140.80    5.0  17.74
...    ...      ...     ...     ...    ...    ...
7248  2011    20.54  1598.0  103.60    5.0    NaN
7249  2015    17.21  1197.0  103.60    5.0    NaN
7250  2012    23.08  1461.0   63.10    5.0    NaN
7251  2013    17.20  1197.0  103.60    5.0    NaN
7252  2014    10.00  2148.0  170.00    5.0    NaN

[7253 rows x 6 columns]

In [ ]:
# Brand Maruti 
# fuel petrol 
# tansmission automatic

In [93]:
data.columns

Index(['place', 'time', 'FUEL', 'trans', 'owner', 'mileage', 'engine', 'power',
       'seats', 'price'],
      dtype='object')

In [96]:
data['power']

0        58.16
1       126.20
2        88.70
3        88.76
4       140.80
         ...
7248    103.60
7249    103.60
7250     63.10
7251    103.60
7252    170.00
Name: power, Length: 7253, dtype: float64

In [95]:
data[['FUEL', 'trans', 'seats']]

        FUEL      trans  seats
0        CNG     Manual    5.0
1     Diesel     Manual    5.0
2     Petrol     Manual    5.0
3     Diesel     Manual    7.0
4     Diesel  Automatic    5.0
...      ...        ...    ...
7248  Diesel     Manual    5.0
7249  Petrol  Automatic    5.0
7250  Diesel     Manual    5.0
7251  Petrol  Automatic    5.0
7252  Diesel  Automatic    5.0

[7253 rows x 3 columns]

In [ ]:
# Handling missing data (fillna, dropna).
Renaming, adding, and dropping columns.
    Transforming and replacing data.

In [ ]:
csv file 
when we load it 
        dataframe if any change.  save in dataframe (inplace=True) 
csv file 
export in to csv file (new version)

In [ ]:
data / 
business probelm (

<h2> <b> Handling missing data (fillna, dropna). </b> </h2>

In [114]:
data.head()

,location,year,run,fuel_type,trans,owner,mileage,engine,power,seats,new_price,price,brand,model,mileage_10p,engine_new,new_price_value,mileage class
0,Mumbai,2010,72000,CNG,Manual,First,26.60,998.0,58.16,5.0,NaN,1.75,Maruti,Wagon,2.660,99.8,0.175,Good Mileage
1,Pune,2015,41000,Diesel,Manual,First,19.67,1582.0,126.20,5.0,NaN,12.50,Hyundai,Creta,1.967,158.2,1.250,Nice Mileage
2,Chennai,2011,46000,Petrol,Manual,First,18.20,1199.0,88.70,5.0,8.61 Lakh,4.50,Honda,Jazz,1.820,119.9,0.450,Nice Mileage
3,Chennai,2012,87000,Diesel,Manual,First,20.77,1248.0,88.76,7.0,NaN,6.00,Maruti,Ertiga,2.077,124.8,0.600,Good Mileage
4,Coimbatore,2013,40670,Diesel,Automatic,Second,15.20,1968.0,140.80,5.0,NaN,17.74,Audi,A4,1.520,196.8,1.774,Nice Mileage

In [115]:
# isna() , is used to find a null or missing values 
data.isna().sum()  # retrusn all 'NA' values in the dataset

location              0
year                  0
run                   0
fuel_type             0
trans                 0
owner                 0
mileage               2
engine               46
power               175
seats                53
new_price          6247
price              1234
brand                 0
model                 0
mileage_10p           2
engine_new           46
new_price_value    1234
mileage class         0
dtype: int64

In [117]:
# Handeling (missing and null) either drop, of fill 
# if values is missing is less than 5% (fill) / drop 
# if values > 5% mss drop 
# new_price nad prcie 
data.shape

(7253, 18)

In [120]:
data.drop(['new_price', 'price'], axis=1, inplace=True)

In [121]:
data.isna().sum()

location              0
year                  0
run                   0
fuel_type             0
trans                 0
owner                 0
mileage               2
engine               46
power               175
seats                53
brand                 0
model                 0
mileage_10p           2
engine_new           46
new_price_value    1234
mileage class         0
dtype: int64

In [123]:
data  = data[['brand', 'model', 'location', 'engine', 'power', 'mileage', 'seats']]

In [124]:
data.isna().sum()

brand         0
model         0
location      0
engine       46
power       175
mileage       2
seats        53
dtype: int64

In [126]:
# delete all the rows with a single cell is 'NA' 
df = data.dropna()

In [127]:
df

              brand    model    location  engine   power  mileage  seats
0            Maruti    Wagon      Mumbai   998.0   58.16    26.60    5.0
1           Hyundai    Creta        Pune  1582.0  126.20    19.67    5.0
2             Honda     Jazz     Chennai  1199.0   88.70    18.20    5.0
3            Maruti   Ertiga     Chennai  1248.0   88.76    20.77    7.0
4              Audi       A4  Coimbatore  1968.0  140.80    15.20    5.0
...             ...      ...         ...     ...     ...      ...    ...
7248     Volkswagen    Vento   Hyderabad  1598.0  103.60    20.54    5.0
7249     Volkswagen     Polo      Mumbai  1197.0  103.60    17.21    5.0
7250         Nissan    Micra     Kolkata  1461.0   63.10    23.08    5.0
7251     Volkswagen     Polo        Pune  1197.0  103.60    17.20    5.0
7252  Mercedes-Benz  E-Class       Kochi  2148.0  170.00    10.00    5.0

[7073 rows x 7 columns]

In [128]:
data.shape

(7253, 7)

In [129]:
df.shape

(7073, 7)

In [ ]:
dropna()

In [130]:
data.shape

(7253, 7)

In [ ]:
# fill na() 
# mode() 
# mean () 
# std() 
# bfill
# afterfill() 
Age: 
Rauthat 
1000 peopel 
20% - 15 200/1000 
30% 17 300/1000
45 % 20  450/1000  
5%= missing ()  20 , mean ,meadin

In [132]:
200/1000

0.2

In [133]:
450/1000

0.45

In [135]:
data.isna().sum()

brand         0
model         0
location      0
engine       46
power       175
mileage       2
seats        53
dtype: int64

In [136]:
average_power = data['power'].mean()
average_power

np.float64(112.76521404351512)

In [138]:
data['power'] = data.power.fillna(average_power)

In [139]:
data['power'].isna().sum()

np.int64(0)

In [ ]:
# temp {data } 
# model {} 
data. colder

In [ ]:
machinelearnig 
data read 
predcit () 
model 
# model deployment { } 
# Data , coluder

In [ ]:
# Roll {0-5} 
20 21 22 {50., 45}